Desktop.org
#+PROPERTY: header-args :mkdirp yes

* Desktop Environment
:PROPERTIES:
:TOC:     2
:END:

This file contains configuration for my overall desktop environment.  My workflow is driven by Emacs but there are still a number of tools, themes, and fonts that I must install to have a complete desktop experience.

** Table of Contents
:PROPERTIES:
:TOC:      this
:END:
-  [[#desktop-environment][Desktop Environment]]
  -  [[#desktop-profile][Desktop Profile]]
  -  [[#window-management][Window Management]]
    -  [[#helper-functions][Helper Functions]]
    -  [[#configuration][Configuration]]
    -  [[#desktop-configuration][Desktop Configuration]]
    -  [[#window-switcher][Window Switcher]]
    -  [[#panel][Panel]]
    -  [[#keybindings][Keybindings]]
    -  [[#useful-links][Useful Links]]
  -  [[#panel-via-polybar][Panel via Polybar]]
  -  [[#desktop-notifications-via-dunst][Desktop Notifications via Dunst]]
  -  [[#display-management][Display Management]]
  -  [[#bluetooth][Bluetooth]]

** Desktop Profile

Here are the packages I install via Guix for my custom desktop environment:

*.config/guix/manifests/desktop.scm:*

#+begin_src scheme :tangle .config/guix/manifests/desktop.scm

(specifications->manifest
 '(;; Browsers
   "vimb"

   ;; Syncthing
   "syncthing"
   "qsyncthingtray"

   ;; Panel
   "polybar"

   ;; Mail
   "mu"
   "offlineimap"

   ;; System Tools
   "openssh"
   "zip"
   "unzip"

   ;; Xorg Tools
   "xev"
   "xset"
   "xrdb"
   "xhost"
   "xmodmap"
   "setxkbmap"
   "xrandr"
   "arandr"
   "xss-lock"
   "libinput"
   "xinput"

   ;; Fonts
   "font-fira-mono"
   "font-fira-code"
   "font-abattis-cantarell"
   "font-dejavu"
   "font-google-noto"
   "font-gnu-freefont-ttf"
   "font-liberation"
   "font-awesome"
   "font-google-material-design-icons"
   "gs-fonts"

   ;; Document Readers
   "zathura"
   "zathura-pdf-mupdf"

   ;; Images and Screenshots
   "feh"
   "scrot"

   ;; Printing
   "cups"

   ;; Desktop
   "dunst"
   "compton"
   "redshift"
   "gucharmap"
   "brightnessctl"
   "xdg-utils"     ;; For xdg-open, etc
   "gtk+:bin"      ;; For gtk-launch
   "glib:bin"      ;; For gio-launch-desktop
   "shared-mime-info"

   ;; Xfce Tools
   "xfconf"
   "xfce4-terminal"
   "xfce4-settings"
   "xfce4-notifyd"
   "xfce4-screenshooter"
   "gtk-xfce-engine"

   ;; GTK Themes
   "arc-icon-theme"
   "matcha-theme"
   "hicolor-icon-theme"
   "gnome-icon-theme"
   "gnome-backgrounds"
   "papirus-icon-theme"

   ;; Authentication
   "password-store"

   ;; Containerized Applications
   "flatpak"  ;; For Teams, Spotify, Discord, and Steam

   ;; Media Players
   "mpv"
   "mpv-mpris"
   "youtube-dl"
   "playerctl"

   ;; Video Codecs
   "gstreamer"
   "gst-plugins-base"
   "gst-plugins-good"
   "gst-plugins-bad"
   "gst-plugins-ugly"
   "gst-libav"
   "intel-vaapi-driver"
   "libva-utils"

   ;; Audio Device Control
   "alsa-utils"
   "pavucontrol"))

#+end_src

** Window Management

I use Emacs as the desktop window manager thanks to the excellent EXWM.  This configuration gets loaded relatively early in Emacs startup if running on a Linux machine.

#+begin_src emacs-lisp :tangle .emacs.d/exwm.el

(use-package exwm
  :init
  (setq mouse-autoselect-window nil
        focus-follows-mouse t
        exwm-workspace-warp-cursor t
        exwm-workspace-number 5)
        ;exwm-workspace-minibuffer-position 'bottom) ;; Annoying focus issues
  :config
  ;; Make class name the buffer name
  (add-hook 'exwm-update-class-hook
            (lambda ()
              (exwm-workspace-rename-buffer exwm-class-name)))
  (add-hook 'exwm-update-title-hook
            (lambda ()
              (when (string-equal exwm-class-name "Vimb")
                (exwm-workspace-rename-buffer (format "vimb: %s" exwm-title)))))

  (exwm-enable))

;; Enable exwm-randr before exwm-init gets called
(use-package exwm-randr
  :if dw/exwm-enabled
  :after (exwm)
  :config
  (exwm-randr-enable)
  (setq exwm-randr-workspace-monitor-plist '(1 "DP-1-2" 4 "eDP-1")))

#+end_src

*** Helper Functions

#+begin_src emacs-lisp :tangle .emacs.d/exwm.el

  (defun exwm/run-in-background (command)
     (start-process-shell-command command nil
                                  command))

  (defun exwm/bind-function (key invocation &rest bindings)
    "Bind KEYs to FUNCTIONs globally"
    (while key
      (exwm-input-set-key (kbd key)
                          `(lambda ()
                             (interactive)
                             ,invocation))
      (setq key (pop bindings)
            command
            (pop bindings))))

  (defun exwm/bind-command (key command &rest bindings)
    "Bind KEYs to COMMANDs globally"
    (while key
      (exwm-input-set-key (kbd key)
                          `(lambda ()
                             (interactive)
                             (exwm/run-in-background ,command)))
      (setq key (pop bindings)
            command
            (pop bindings))))

#+END_SRC

*** Configuration

#+begin_src emacs-lisp :tangle .emacs.d/exwm.el

  (defun dw/exwm-init-hook ()
    ;; Launch Telega in workspace 0 if we've logged in before
    (when (file-exists-p "~/.telega/db.sqlite")
      (telega nil))

    ;; Make workspace 1 be the one where we land at startup
    (exwm-workspace-switch-create 1)

    ;; Open eshell by default
    (eshell)

    ;; Launch apps that will run in the background
    (exwm/run-in-background "nm-applet")
    (exwm/run-in-background "QSyncthingTray")
    (exwm/run-in-background "redshift -l 47.675510:-122.203362 -t 6500:3500"))

  (use-package exwm
    :if dw/exwm-enabled
    :config
    ;(display-time-mode 1) ;; Not needed for now since we have a panel

    (add-hook 'exwm-mode-hook
              (lambda ()
                (evil-local-set-key 'motion (kbd "C-u") nil)))

    (require 'dw-exwm)

    (defun dw/setup-window-by-class ()
      (interactive)
      (pcase exwm-class-name
        ("Pidgin" (exwm-workspace-move-window 0))
        ("Pidgin<2>" (exwm-workspace-move-window 0))
        ("teams-for-linux" (exwm-workspace-move-window 3))
        ("Microsoft Teams - Preview" (exwm-workspace-move-window 3))
        ("Spotify" (exwm-workspace-move-window 4))
        ("Vimb" (exwm-workspace-move-window 2))
        ("qjackctl" (exwm-floating-toggle-floating))
        ("mpv" (exwm-floating-toggle-floating)
               (dw/exwm-floating-toggle-pinned))))

    ;; Do some post-init setup
    (add-hook 'exwm-init-hook #'dw/exwm-init-hook)

    ;; Manipulate windows as they're created
    (add-hook 'exwm-manage-finish-hook
              (lambda ()
                ;; Send the window where it belongs
                (dw/setup-window-by-class)))

                ;; Hide the modeline on all X windows
                ;(exwm-layout-hide-mode-line)))

    ;; Hide the modeline on all X windows
    (add-hook 'exwm-floating-setup-hook
              (lambda ()
                (exwm-layout-hide-mode-line))))

  (use-package exwm-systemtray
    :disabled
    :if dw/exwm-enabled
    :after (exwm)
    :config
    (exwm-systemtray-enable)
    (setq exwm-systemtray-height 35))

#+END_SRC

*** Desktop Configuration

#+begin_src emacs-lisp :tangle .emacs.d/exwm.el

  (defun dw/run-xmodmap ()
    (interactive)
    (start-process-shell-command "xmodmap" nil "xmodmap ~/.dotfiles/.config/i3/Xmodmap"))

  (defun dw/update-wallpapers ()
    (interactive)
    (start-process-shell-command "feh" nil "feh --bg-scale ~/.dotfiles/backgrounds/mountains-1412683.jpg"))

  (setq dw/panel-process nil)
  (defun dw/kill-panel ()
    (interactive)
    (when dw/panel-process
      (ignore-errors
        (kill-process dw/panel-process)))
    (setq dw/panel-process nil))

  (defun dw/start-panel ()
    (interactive)
    (dw/kill-panel)
    (setq dw/panel-process (start-process-shell-command "polybar" nil "polybar panel")))

  (defun dw/update-screen-layout ()
    (interactive)
    (let ((layout-script "~/.bin/update-screens"))
       (message "Running screen layout script: %s" layout-script)
       (start-process-shell-command "xrandr" nil layout-script)))

  (defun dw/configure-desktop ()
    (interactive)
      (dw/run-xmodmap)
      (dw/update-screen-layout)
      (run-at-time "2 sec" nil (lambda () (dw/update-wallpapers))))

  (defun dw/on-exwm-init ()
    (dw/configure-desktop)
    (dw/start-panel))

  (when dw/exwm-enabled
    ;; Configure the desktop for first load
    (add-hook 'exwm-init-hook #'dw/on-exwm-init))

#+END_SRC

*** Window Switcher

#+begin_src emacs-lisp :tangle .emacs.d/exwm.el

  (defalias 'switch-to-buffer-original 'exwm-workspace-switch-to-buffer)
  ;; (defalias 'switch-to-buffer 'exwm-workspace-switch-to-buffer)

  ;; (defun dw/counsel-switch-buffer ()
  ;;   "Switch to another buffer.
  ;; Display a preview of the selected ivy completion candidate buffer
  ;; in the current window."
  ;;   (interactive)
  ;;   (ivy-read "Switch to buffer: " 'internal-complete-buffer
  ;;             :preselect (buffer-name (other-buffer (current-buffer)))
  ;;             :keymap ivy-switch-buffer-map
  ;;             :action #'ivy--switch-buffer-action
  ;;             :matcher #'ivy--switch-buffer-matcher
  ;;             :caller 'counsel-switch-buffer
  ;;             :unwind #'counsel--switch-buffer-unwind
  ;;             :update-fn 'counsel--switch-buffer-update-fn)
  ;; )

#+end_src

